Rhino.Inside.Revit API
GeometryEncoder.ToPoints Method
 Converts the specified Rhino.Geometry.PointCloud to an equivalent array of Autodesk.Revit.DB.Point.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.Point[] ToPoints(
	this Rhino.Geometry.PointCloud pointCloud
)
@staticmethod
def ToPoints(
	pointCloud: Rhino.Geometry.PointCloud
) -> Array[Autodesk.Revit.DB.Point]
Parameters
pointCloud
Type: Rhino.Geometry.PointCloud
Rhino pointcloud to convert.
Return Value
Type: Autodesk.Revit.DB.Point[]
Revit point array that is equivalent to the provided Rhino pointcloud.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.PointCloud. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToPoints(PointCloud) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Point[] revitPoints = rhinoPointCloud.ToPoints();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System import Array
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_points = rhino_pointcloud.ToPoints()    # type: Array[DB.Point]
 Using ToPoints(PointCloud) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Point[] revitPoints = GeometryEncoder.ToPoints(rhinoPointCloud);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System import Array
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_points = GE.ToPoints(rhino_pointcloud)    # type: Array[DB.Point]
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace